<!DOCTYPE html><html lang="en" data-theme="light"><head><meta charset="UTF-8"><meta http-equiv="X-UA-Compatible" content="IE=edge"><meta name="viewport" content="width=device-width, initial-scale=1.0,viewport-fit=cover"><title>CISCN2017-babydriver | pwn生之loo</title><meta name="author" content="John Doe"><meta name="copyright" content="John Doe"><meta name="format-detection" content="telephone=no"><meta name="theme-color" content="#ffffff"><meta name="description" content="PART Iunpack12loo@localhost:~&#x2F;ctf&#x2F;kernel&#x2F;xiaozaiya&#x2F;kernel-PWN&#x2F;CISCN2017-babydriver&#x2F;try$ file .&#x2F;rootfs.cpio.&#x2F;rootfs.cpio: ASCII cpio archive (SVR4 with no CRC) md core &amp;&amp; cd .&#x2F;core &amp;&amp; c">
<meta property="og:type" content="article">
<meta property="og:title" content="CISCN2017-babydriver">
<meta property="og:url" content="http://example.com/2025/06/20/CISCN2017-babydriver/index.html">
<meta property="og:site_name" content="pwn生之loo">
<meta property="og:description" content="PART Iunpack12loo@localhost:~&#x2F;ctf&#x2F;kernel&#x2F;xiaozaiya&#x2F;kernel-PWN&#x2F;CISCN2017-babydriver&#x2F;try$ file .&#x2F;rootfs.cpio.&#x2F;rootfs.cpio: ASCII cpio archive (SVR4 with no CRC) md core &amp;&amp; cd .&#x2F;core &amp;&amp; c">
<meta property="og:locale" content="en_US">
<meta property="og:image" content="http://example.com/pic/logo.png">
<meta property="article:published_time" content="2025-06-20T08:24:02.432Z">

<figure class="highlight shell"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br><span class="line">74</span><br><span class="line">75</span><br><span class="line">76</span><br><span class="line">77</span><br><span class="line">78</span><br><span class="line">79</span><br><span class="line">80</span><br><span class="line">81</span><br><span class="line">82</span><br><span class="line">83</span><br><span class="line">84</span><br><span class="line">85</span><br><span class="line">86</span><br><span class="line">87</span><br><span class="line">88</span><br><span class="line">89</span><br><span class="line">90</span><br><span class="line">91</span><br><span class="line">92</span><br><span class="line">93</span><br><span class="line">94</span><br><span class="line">95</span><br><span class="line">96</span><br><span class="line">97</span><br><span class="line">98</span><br><span class="line">99</span><br><span class="line">100</span><br><span class="line">101</span><br><span class="line">102</span><br><span class="line">103</span><br><span class="line">104</span><br><span class="line">105</span><br><span class="line">106</span><br><span class="line">107</span><br><span class="line">108</span><br><span class="line">109</span><br><span class="line">110</span><br><span class="line">111</span><br><span class="line">112</span><br><span class="line">113</span><br><span class="line">114</span><br><span class="line">115</span><br><span class="line">116</span><br><span class="line">117</span><br><span class="line">118</span><br><span class="line">119</span><br><span class="line">120</span><br><span class="line">121</span><br><span class="line">122</span><br><span class="line">123</span><br><span class="line">124</span><br><span class="line">125</span><br><span class="line">126</span><br><span class="line">127</span><br><span class="line">128</span><br><span class="line">129</span><br><span class="line">130</span><br><span class="line">131</span><br><span class="line">132</span><br><span class="line">133</span><br><span class="line">134</span><br><span class="line">135</span><br><span class="line">136</span><br><span class="line">137</span><br><span class="line">138</span><br><span class="line">139</span><br><span class="line">140</span><br><span class="line">141</span><br><span class="line">142</span><br><span class="line">143</span><br><span class="line">144</span><br><span class="line">145</span><br><span class="line">146</span><br><span class="line">147</span><br><span class="line">148</span><br><span class="line">149</span><br><span class="line">150</span><br><span class="line">151</span><br><span class="line">152</span><br><span class="line">153</span><br><span class="line">154</span><br><span class="line">155</span><br><span class="line">156</span><br><span class="line">157</span><br><span class="line">158</span><br><span class="line">159</span><br><span class="line">160</span><br><span class="line">161</span><br><span class="line">162</span><br><span class="line">163</span><br><span class="line">164</span><br><span class="line">165</span><br><span class="line">166</span><br><span class="line">167</span><br><span class="line">168</span><br><span class="line">169</span><br><span class="line">170</span><br><span class="line">171</span><br><span class="line">172</span><br><span class="line">173</span><br><span class="line">174</span><br><span class="line">175</span><br><span class="line">176</span><br><span class="line">177</span><br><span class="line">178</span><br><span class="line">179</span><br><span class="line">180</span><br><span class="line">181</span><br><span class="line">182</span><br><span class="line">183</span><br><span class="line">184</span><br><span class="line">185</span><br><span class="line">186</span><br><span class="line">187</span><br><span class="line">188</span><br><span class="line">189</span><br><span class="line">190</span><br><span class="line">191</span><br><span class="line">192</span><br><span class="line">193</span><br><span class="line">194</span><br><span class="line">195</span><br><span class="line">196</span><br><span class="line">197</span><br><span class="line">198</span><br><span class="line">199</span><br><span class="line">200</span><br><span class="line">201</span><br><span class="line">202</span><br><span class="line">203</span><br><span class="line">204</span><br><span class="line">205</span><br><span class="line">206</span><br><span class="line">207</span><br><span class="line">208</span><br><span class="line">209</span><br><span class="line">210</span><br></pre></td><td class="code"><pre><span class="line">loo@localhost:~/ctf/kernel/xiaozaiya/kernel-PWN/CISCN2017-babydriver/try$ pahole -C tty_struct ./vmlinux_c</span><br><span class="line">struct tty_struct &#123;</span><br><span class="line">        int                        magic;                /*     0     4 */</span><br><span class="line">        struct kref                kref;                 /*     4     4 */</span><br><span class="line">        struct device *            dev;                  /*     8     8 */</span><br><span class="line">        struct tty_driver *        driver;               /*    16     8 */</span><br><span class="line">        const struct tty_operations  * ops;              /*    24     8 */</span><br><span class="line">        int                        index;                /*    32     4 */</span><br><span class="line"></span><br><span class="line">        /* XXX 4 bytes hole, try to pack */</span><br><span class="line"></span><br><span class="line">        struct ld_semaphore        ldisc_sem;            /*    40    48 */</span><br><span class="line">        /* --- cacheline 1 boundary (64 bytes) was 24 bytes ago --- */</span><br><span class="line">        struct tty_ldisc *         ldisc;                /*    88     8 */</span><br><span class="line">        struct mutex               atomic_write_lock;    /*    96    40 */</span><br><span class="line"></span><br><span class="line">        /* XXX last struct has 4 bytes of padding */</span><br><span class="line"></span><br><span class="line">        /* --- cacheline 2 boundary (128 bytes) was 8 bytes ago --- */</span><br><span class="line">        struct mutex               legacy_mutex;         /*   136    40 */</span><br><span class="line"></span><br><span class="line">        /* XXX last struct has 4 bytes of padding */</span><br><span class="line"></span><br><span class="line">        struct mutex               throttle_mutex;       /*   176    40 */</span><br><span class="line"></span><br><span class="line">        /* XXX last struct has 4 bytes of padding */</span><br><span class="line"></span><br><span class="line">        /* --- cacheline 3 boundary (192 bytes) was 24 bytes ago --- */</span><br><span class="line">        struct rw_semaphore        termios_rwsem;        /*   216    40 */</span><br><span class="line">        /* --- cacheline 4 boundary (256 bytes) --- */</span><br><span class="line">        struct mutex               winsize_mutex;        /*   256    40 */</span><br><span class="line"></span><br><span class="line">        /* XXX last struct has 4 bytes of padding */</span><br><span class="line"></span><br><span class="line">        spinlock_t                 ctrl_lock;            /*   296     4 */</span><br><span class="line">        spinlock_t                 flow_lock;            /*   300     4 */</span><br><span class="line">        struct ktermios            termios;              /*   304    44 */</span><br><span class="line">        /* --- cacheline 5 boundary (320 bytes) was 28 bytes ago --- */</span><br><span class="line">        struct ktermios            termios_locked;       /*   348    44 */</span><br><span class="line">        /* --- cacheline 6 boundary (384 bytes) was 8 bytes ago --- */</span><br><span class="line">        struct termiox *           termiox;              /*   392     8 */</span><br><span class="line">        char                       name[64];             /*   400    64 */</span><br><span class="line">        /* --- cacheline 7 boundary (448 bytes) was 16 bytes ago --- */</span><br><span class="line">        struct pid *               pgrp;                 /*   464     8 */</span><br><span class="line">        struct pid *               session;              /*   472     8 */</span><br><span class="line">        long unsigned int          flags;                /*   480     8 */</span><br><span class="line">        int                        count;                /*   488     4 */</span><br><span class="line">        struct winsize             winsize;              /*   492     8 */</span><br><span class="line"></span><br><span class="line">        /* Bitfield combined with next fields */</span><br><span class="line"></span><br><span class="line">        long unsigned int          stopped:1;            /*   496:32  8 */</span><br><span class="line">        long unsigned int          flow_stopped:1;       /*   496:33  8 */</span><br><span class="line"></span><br><span class="line">        /* XXX 30 bits hole, try to pack */</span><br><span class="line"></span><br><span class="line">        /* Force alignment to the next boundary: */</span><br><span class="line">        long unsigned int          :0;</span><br><span class="line"></span><br><span class="line">        long unsigned int          unused:62;            /*   504: 0  8 */</span><br><span class="line"></span><br><span class="line">        /* XXX 2 bits hole, try to pack */</span><br><span class="line"></span><br><span class="line">        /* --- cacheline 8 boundary (512 bytes) --- */</span><br><span class="line">        int                        hw_stopped;           /*   512     4 */</span><br><span class="line"></span><br><span class="line">        /* Bitfield combined with previous fields */</span><br><span class="line"></span><br><span class="line">        long unsigned int          ctrl_status:8;        /*   512:32  8 */</span><br><span class="line">        long unsigned int          packet:1;             /*   512:40  8 */</span><br><span class="line"></span><br><span class="line">        /* XXX 23 bits hole, try to pack */</span><br><span class="line"></span><br><span class="line">        /* Force alignment to the next boundary: */</span><br><span class="line">        long unsigned int          :0;</span><br><span class="line"></span><br><span class="line">        long unsigned int          unused_ctrl:55;       /*   520: 0  8 */</span><br><span class="line"></span><br><span class="line">        /* XXX 9 bits hole, try to pack */</span><br><span class="line"></span><br><span class="line">        unsigned int               receive_room;         /*   528     4 */</span><br><span class="line">        int                        flow_change;          /*   532     4 */</span><br><span class="line">        struct tty_struct *        link;                 /*   536     8 */</span><br><span class="line">        struct fasync_struct *     fasync;               /*   544     8 */</span><br><span class="line">        int                        alt_speed;            /*   552     4 */</span><br><span class="line"></span><br><span class="line">        /* XXX 4 bytes hole, try to pack */</span><br><span class="line"></span><br><span class="line">        wait_queue_head_t          write_wait;           /*   560    24 */</span><br><span class="line">        /* --- cacheline 9 boundary (576 bytes) was 8 bytes ago --- */</span><br><span class="line">        wait_queue_head_t          read_wait;            /*   584    24 */</span><br><span class="line">        struct work_struct         hangup_work;          /*   608    32 */</span><br><span class="line">        /* --- cacheline 10 boundary (640 bytes) --- */</span><br><span class="line">        void *                     disc_data;            /*   640     8 */</span><br><span class="line">        void *                     driver_data;          /*   648     8 */</span><br><span class="line">        struct list_head           tty_files;            /*   656    16 */</span><br><span class="line">        int                        closing;              /*   672     4 */</span><br><span class="line"></span><br><span class="line">        /* XXX 4 bytes hole, try to pack */</span><br><span class="line"></span><br><span class="line">        unsigned char *            write_buf;            /*   680     8 */</span><br><span class="line">        int                        write_cnt;            /*   688     4 */</span><br><span class="line"></span><br><span class="line">        /* XXX 4 bytes hole, try to pack */</span><br><span class="line"></span><br><span class="line">        struct work_struct         SAK_work;             /*   696    32 */</span><br><span class="line">        /* --- cacheline 11 boundary (704 bytes) was 24 bytes ago --- */</span><br><span class="line">        struct tty_port *          port;                 /*   728     8 */</span><br><span class="line"></span><br><span class="line">        /* size: 736, cachelines: 12, members: 47 */</span><br><span class="line">        /* sum members: 696, holes: 4, sum holes: 16 */</span><br><span class="line">        /* sum bitfield members: 128 bits, bit holes: 4, sum bit holes: 64 bits */</span><br><span class="line">        /* paddings: 4, sum paddings: 16 */</span><br><span class="line">        /* last cacheline: 32 bytes */</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line">loo@localhost:~/ctf/kernel/xiaozaiya/kernel-PWN/CISCN2017-babydriver/try$ pahole -C tty_struct</span><br><span class="line">struct tty_struct &#123;</span><br><span class="line">        int                        magic;                /*     0     4 */</span><br><span class="line">        struct kref                kref;                 /*     4     4 */</span><br><span class="line">        struct device *            dev;                  /*     8     8 */</span><br><span class="line">        struct tty_driver *        driver;               /*    16     8 */</span><br><span class="line">        const struct tty_operations  * ops;              /*    24     8 */</span><br><span class="line">        int                        index;                /*    32     4 */</span><br><span class="line"></span><br><span class="line">        /* XXX 4 bytes hole, try to pack */</span><br><span class="line"></span><br><span class="line">        struct ld_semaphore        ldisc_sem;            /*    40    48 */</span><br><span class="line">        /* --- cacheline 1 boundary (64 bytes) was 24 bytes ago --- */</span><br><span class="line">        struct tty_ldisc *         ldisc;                /*    88     8 */</span><br><span class="line">        struct mutex               atomic_write_lock;    /*    96    32 */</span><br><span class="line">        /* --- cacheline 2 boundary (128 bytes) --- */</span><br><span class="line">        struct mutex               legacy_mutex;         /*   128    32 */</span><br><span class="line">        struct mutex               throttle_mutex;       /*   160    32 */</span><br><span class="line">        /* --- cacheline 3 boundary (192 bytes) --- */</span><br><span class="line">        struct rw_semaphore        termios_rwsem;        /*   192    40 */</span><br><span class="line">        struct mutex               winsize_mutex;        /*   232    32 */</span><br><span class="line">        /* --- cacheline 4 boundary (256 bytes) was 8 bytes ago --- */</span><br><span class="line">        struct ktermios            termios;              /*   264    44 */</span><br><span class="line">        struct ktermios            termios_locked;       /*   308    44 */</span><br><span class="line">        /* --- cacheline 5 boundary (320 bytes) was 32 bytes ago --- */</span><br><span class="line">        char                       name[64];             /*   352    64 */</span><br><span class="line">        /* --- cacheline 6 boundary (384 bytes) was 32 bytes ago --- */</span><br><span class="line">        long unsigned int          flags;                /*   416     8 */</span><br><span class="line">        int                        count;                /*   424     4 */</span><br><span class="line">        struct winsize             winsize;              /*   428     8 */</span><br><span class="line"></span><br><span class="line">        /* XXX 4 bytes hole, try to pack */</span><br><span class="line"></span><br><span class="line">        struct &#123;</span><br><span class="line">                spinlock_t         lock;                 /*   440     4 */</span><br><span class="line">                bool               stopped;              /*   444     1 */</span><br><span class="line">                bool               tco_stopped;          /*   445     1 */</span><br><span class="line"></span><br><span class="line">                /* XXX 2 bytes hole, try to pack */</span><br><span class="line"></span><br><span class="line">                /* --- cacheline 7 boundary (448 bytes) --- */</span><br><span class="line">                long unsigned int  unused[];             /*   448     0 */</span><br><span class="line">        &#125; flow;                                          /*   440     8 */</span><br><span class="line">        struct &#123;</span><br><span class="line">                spinlock_t         lock;                 /*   448     4 */</span><br><span class="line"></span><br><span class="line">                /* XXX 4 bytes hole, try to pack */</span><br><span class="line"></span><br><span class="line">                struct pid *       pgrp;                 /*   456     8 */</span><br><span class="line">                struct pid *       session;              /*   464     8 */</span><br><span class="line">                unsigned char      pktstatus;            /*   472     1 */</span><br><span class="line">                bool               packet;               /*   473     1 */</span><br><span class="line"></span><br><span class="line">                /* XXX 6 bytes hole, try to pack */</span><br><span class="line"></span><br><span class="line">                long unsigned int  unused[];             /*   480     0 */</span><br><span class="line">        &#125; ctrl;                                          /*   448    32 */</span><br><span class="line">        int                        hw_stopped;           /*   480     4 */</span><br><span class="line">        unsigned int               receive_room;         /*   484     4 */</span><br><span class="line">        int                        flow_change;          /*   488     4 */</span><br><span class="line"></span><br><span class="line">        /* XXX 4 bytes hole, try to pack */</span><br><span class="line"></span><br><span class="line">        struct tty_struct *        link;                 /*   496     8 */</span><br><span class="line">        struct fasync_struct *     fasync;               /*   504     8 */</span><br><span class="line">        /* --- cacheline 8 boundary (512 bytes) --- */</span><br><span class="line">        wait_queue_head_t          write_wait;           /*   512    24 */</span><br><span class="line">        wait_queue_head_t          read_wait;            /*   536    24 */</span><br><span class="line">        struct work_struct         hangup_work;          /*   560    32 */</span><br><span class="line">        /* --- cacheline 9 boundary (576 bytes) was 16 bytes ago --- */</span><br><span class="line">        void *                     disc_data;            /*   592     8 */</span><br><span class="line">        void *                     driver_data;          /*   600     8 */</span><br><span class="line">        spinlock_t                 files_lock;           /*   608     4 */</span><br><span class="line"></span><br><span class="line">        /* XXX 4 bytes hole, try to pack */</span><br><span class="line"></span><br><span class="line">        struct list_head           tty_files;            /*   616    16 */</span><br><span class="line">        int                        closing;              /*   632     4 */</span><br><span class="line"></span><br><span class="line">        /* XXX 4 bytes hole, try to pack */</span><br><span class="line"></span><br><span class="line">        /* --- cacheline 10 boundary (640 bytes) --- */</span><br><span class="line">        unsigned char *            write_buf;            /*   640     8 */</span><br><span class="line">        int                        write_cnt;            /*   648     4 */</span><br><span class="line"></span><br><span class="line">        /* XXX 4 bytes hole, try to pack */</span><br><span class="line"></span><br><span class="line">        struct work_struct         SAK_work;             /*   656    32 */</span><br><span class="line">        struct tty_port *          port;                 /*   688     8 */</span><br><span class="line"></span><br><span class="line">        /* size: 696, cachelines: 11, members: 38 */</span><br><span class="line">        /* sum members: 672, holes: 6, sum holes: 24 */</span><br><span class="line">        /* last cacheline: 56 bytes */</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>

<pre><code>	### 12. Q&amp;A
</code></pre>
<p>应该是这样，但总是出现uaf失败的情况，貌似是程序逻辑问题<br>没错确实是逻辑问题，与程序无关</p>
<figure class="highlight c"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br></pre></td><td class="code"><pre><span class="line">pwndbg&gt; tele <span class="number">0xffff88001cafe400</span></span><br><span class="line"><span class="number">00</span>:<span class="number">0000</span>│ rsi <span class="number">0xffff88001cafe400</span> ◂— <span class="number">0x100005401</span></span><br><span class="line"><span class="number">01</span>:<span class="number">0008</span>│     <span class="number">0xffff88001cafe408</span> ◂— <span class="number">0</span></span><br><span class="line"><span class="number">02</span>:<span class="number">0010</span>│     <span class="number">0xffff88001cafe410</span> —▸ <span class="number">0xffff88001c8e9a80</span> ◂— <span class="number">0x200005402</span></span><br><span class="line"><span class="number">03</span>:<span class="number">0018</span>│     <span class="number">0xffff88001cafe418</span> —▸ <span class="number">0xffffffff81a74f80</span> (ptm_unix98_ops) —▸ <span class="number">0xffffffff814e2640</span> (ptm_unix98_lookup) ◂— nop dword ptr [rax + rax]</span><br><span class="line"><span class="number">04</span>:<span class="number">0020</span>│     <span class="number">0xffff88001cafe420</span> ◂— <span class="number">0</span></span><br><span class="line">... ↓        <span class="number">2</span> skipped</span><br><span class="line"><span class="number">07</span>:<span class="number">0038</span>│     <span class="number">0xffff88001cafe438</span> ◂— <span class="number">0xffff88001cafe438</span></span><br><span class="line">pwndbg&gt;</span><br><span class="line"><span class="number">08</span>:<span class="number">0040</span>│  <span class="number">0xffff88001cafe440</span> —▸ <span class="number">0xffff88001cafe438</span> ◂— <span class="number">0xffff88001cafe438</span></span><br><span class="line"><span class="number">09</span>:<span class="number">0048</span>│  <span class="number">0xffff88001cafe448</span> ◂— <span class="number">0xffff88001cafe448</span></span><br><span class="line"><span class="number">0</span>a:<span class="number">0050</span>│  <span class="number">0xffff88001cafe450</span> —▸ <span class="number">0xffff88001cafe448</span> ◂— <span class="number">0xffff88001cafe448</span></span><br><span class="line"><span class="number">0b</span>:<span class="number">0058</span>│  <span class="number">0xffff88001cafe458</span> —▸ <span class="number">0xffff88001c8539f0</span> —▸ <span class="number">0xffffffff81eb8f80</span> (tty_ldisc_N_TTY) ◂— <span class="number">0x5403</span></span><br><span class="line"><span class="number">0</span>c:<span class="number">0060</span>│  <span class="number">0xffff88001cafe460</span> ◂— <span class="number">1</span></span><br><span class="line"><span class="number">0</span>d:<span class="number">0068</span>│  <span class="number">0xffff88001cafe468</span> ◂— <span class="number">0xffff88001cafe468</span></span><br><span class="line"><span class="number">0</span>e:<span class="number">0070</span>│  <span class="number">0xffff88001cafe470</span> —▸ <span class="number">0xffff88001cafe468</span> ◂— <span class="number">0xffff88001cafe468</span></span><br><span class="line"><span class="number">0f</span>:<span class="number">0078</span>│  <span class="number">0xffff88001cafe478</span> ◂— <span class="number">0</span></span><br></pre></td></tr></table></figure>
<h2 id="op"><a href="#op" class="headerlink" title="op"></a>op</h2><ul>
<li><code>groups loo</code></li>
<li><code>pahole -C cred ./vmlinux</code></li>
</ul>
<h1 id="参考"><a href="#参考" class="headerlink" title="参考"></a>参考</h1><ul>
<li><a target="_blank" rel="noopener" href="https://arttnba3.cn/2021/03/03/PWN-0X00-LINUX-KERNEL-PWN-PART-I/">【PWN.0x00】Linux Kernel Pwn I：Basic Exploit to Kernel Pwn in CTF - arttnba3’s blog</a></li>
<li><a target="_blank" rel="noopener" href="https://blog.csdn.net/qq_61670993/article/details/133414825">【kernel-pwn】一题多解：从CISCN2017-babydriver入门题带你学习tty_struct、seq_file、msg_msg、pt_regs的利用_ciscn 2017 babydrive-CSDN博客</a></li>
</ul>
